examples/OpenFOAM/pipe_with_recirc_3d/scalar_transport/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "804";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
90300
(
(0.0917285 -0.00133431 0.00603278)
(0.150162 0.0452255 0.0305105)
(0.131356 0.0885087 0.0461755)
(0.0944541 0.0992859 0.0440012)
(0.0758642 0.0841076 0.0322101)
(0.0789547 0.064391 0.0208251)
(0.0842622 0.0572778 0.0125343)
(0.0776297 0.0643251 0.00631143)
...
)
;

boundaryField
{
    top_and_bottom
    {
        type            noSlip;
    }
    wall
    {
        type            noSlip;
    }
    inlet
    {
        type            codedFixedValue;
        value           nonuniform List<vector> 
480
(
(0.0244777 0 0)
(0.0696674 0 0)
(0.109836 0 0)
(0.144984 0 0)
(0.17511 0 0)
(0.200215 0 0)
(0.2203 0 0)
(0.235363 0 0)
...
)
;
        name            parabolicVelocity;
        code            #{
              const vectorField& Cf = patch().Cf();
              vectorField& field = *this;
              
              const scalar Umax = 10;
              
              forAll(Cf, faceI)
              {
                  const scalar y = Cf[faceI][1];
                  const scalar z = Cf[faceI][2];
                  
                  field[faceI] = vector(
                    Umax * 64 * y * (0.5 - y) * z * (1 - z), 
                    0,
                    0
                  );
              }
        #};
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
